package org.itstep.task06;

/**
 * Задание
 * Описать  базовый  класс  MainString  (Строка).
 * <p>
 * Обязательные поля класса:
 * - массив символов (chars);
 * <p>
 * Реализовать  обязательные  методы  следующего  назначения:
 * - конструктор без параметров - создается массив chars нулевого размера;
 * - конструктор, принимающий в качестве параметра данные типа CharSequence - массив chars заполняется
     данными указанного объекта;
 * - конструктор, принимающий в качестве параметра символ и длину строки - создается массив символов chars
     заданного размера и заполняется указанным символом размером;
 *
 * - метод получения длины строки length() - возвращает размер массива chars;
 * - метод clean() очистки строки (делает строку пустой);
 * - метод конкатенации (concat()) - соединяет две строки типа MainString;
 * - метод поиска символа в строке indexOf() - принимает символ (в вдите int), возвращает индекс первого вхождения символа в строке.
 * - метод toString(), который возвращает строковое представление объекта
 * <p>
 * Класс должен находиться в отдельном файле в этом же пакете
 */
public class Main {
    public static void main(String[] args) {

    }
}
