package org.itstep.task05;

/**
 * Создать  класс  Money  (Деньги)  для  работы  с  денежными  суммами.
 * <p>
 * Число должно быть представлено двумя полями:
 * - типа long (hryvnia)  – для гривен;
 * - типа byte (kopecks) – для копеек.
 * <p>
 * Добавить сеттеры и геттеры для полей
 * <p>
 * Добавить три конструктора: по умолчанию и два с параметрами (первый принимает только гривны, второй - гривны и копейки)
 * <p>
 * Реализовать вывод значения на экран, при этом дробная часть должна быть отделена от целой части запятой.
 * <p>
 * Реализовать методы:
 * - сложение (addition).
 * - вычитание (subtraction),
 * - деление на дробное число (division),
 * - умножение на дробное число (multiply)
 * - операции сравнения (метод equals) возвращает boolean.
 * <p>
 * Методы сложения, вычитания должны принимать другой объект Money
 * Методы деления и умножения принимают данные типа double
 * <p>
 * Все методы, кроме equals, возвращают результат типа Money
 * <p>
 * Класс должен находиться в отдельном файле в этом же пакете
 *
 * Примечание: не учитывать номиналы купюр и монет
 */
public class Main {
    public static void main(String[] args) {

    }
}
